In [2]:
import pandas as pd

Creating a DataFrame from couple of series Objects, the only condition would be all the objects should have similar indices

In [3]:
ID_uname = ['sgutter' , 'lnarmen' , 'vvoghan' , 'kkoltin']  ## Index of all the series Objects is in list type
Fname = pd.Series(data=["Steve" , "Lia" , "Vin" , "Katie"] , index=[ID_uname])
LName = pd.Series(data=["Gutter" , "Narmen" , "Voughan" , "Koltin" ], index=[ID_uname])
Age	= pd.Series(data=[32 , 28 , 45 ,38], index=[ID_uname])
Gender	= pd.Series(data=["Male" , "Female" , "Male" , "Female"], index=[ID_uname])	
Rating = pd.Series(data=[3.45, 4.6, 3.9, 2.78], index=[ID_uname])
Nationality = pd.Series(data ='IN', index=[ID_uname])

Syntax: pandas.DataFrame({'Column_name': Series_Object, 'Column_name': Series_Object, 'Column_name': Series_Object})

In [4]:
Df_12 = pd.DataFrame({'First_Name': Fname, 
                      'Last_Name': LName , 
                      'Age': Age ,
                      "Gender" : Gender , 
                      'Rating' : Rating , 
                      'Nationality' : Nationality})
Df_12

        First_Name Last_Name  Age  Gender  Rating Nationality
sgutter      Steve    Gutter   32    Male    3.45          IN
lnarmen        Lia    Narmen   28  Female    4.60          IN
vvoghan        Vin   Voughan   45    Male    3.90          IN
kkoltin      Katie    Koltin   38  Female    2.78          IN

Slicing and accessing values from dataframe, 
example:
   1. dataframe[['Column name']] --> returns a DF
   2. dataframe['Column name'] --> returns a series object
   3. dataframe.Column_Name --> returns a series object with column values and indices
   4. dataframe.Column_Name.loc['index_name'] --> returns series object with a specific value

In [5]:
Df_12['First_Name']

sgutter    Steve
lnarmen      Lia
vvoghan      Vin
kkoltin    Katie
Name: First_Name, dtype: object

In [6]:
type(Df_12['First_Name'])

pandas.core.series.Series

In [7]:
Df_12[['First_Name']]

        First_Name
sgutter      Steve
lnarmen        Lia
vvoghan        Vin
kkoltin      Katie

In [8]:
type(Df_12[['First_Name']])

pandas.core.frame.DataFrame

In [9]:
Df_12[['First_Name']]['sgutter']### Error

KeyError: 'sgutter'

In [ ]:
Df_12['First_Name']['gutter']

In [10]:
Df_12['First_Name']['sgutter'] ## The correct way of slicing

sgutter    Steve
Name: First_Name, dtype: object

In [11]:
Df_12[['First_Name','Age']]## Calling out multiple collumns

        First_Name  Age
sgutter      Steve   32
lnarmen        Lia   28
vvoghan        Vin   45
kkoltin      Katie   38

In [12]:
Df_12[['First_Name','Age']].head(2)

        First_Name  Age
sgutter      Steve   32
lnarmen        Lia   28

In [13]:
Df_12[['First_Name','Age']].tail(2)

        First_Name  Age
vvoghan        Vin   45
kkoltin      Katie   38

In [14]:
Df_12.First_Name

sgutter    Steve
lnarmen      Lia
vvoghan      Vin
kkoltin    Katie
Name: First_Name, dtype: object

In [15]:
type(Df_12.First_Name)

pandas.core.series.Series

In [16]:
Df_12.columns.get_loc('Age') ## gets the column location number

2

Slicing data out of DataFrame object, DFObject[ starting positional index : ending positional index - 1 : steps to hop ]
If none are given, complete DataFrame Object will be displayed. The values can be given in negative as well.

    Example:
        1. [ : ending positional index - 1 : steps to hop ] --> displays from start to (ending -1)
        2. [ starting positional index : : steps to hop ] --> displays drom starting till ending
        3. [ starting positional index : ending positional index - 1 : -step ] --> displays indices in reverse order
        4. [From index lable name : To index lable name 
        5. dataFrame.at[row , collumn] --> Access with the lables, returns a specific value
        6. dataFrame.iat[row,collumn] --> Access with the index values, returns a specific value
        7. DataFrame[::]['Column'] --> Will return a specific value at the position

In [17]:
Df_12[::]## Displays full dataframe

        First_Name Last_Name  Age  Gender  Rating Nationality
sgutter      Steve    Gutter   32    Male    3.45          IN
lnarmen        Lia    Narmen   28  Female    4.60          IN
vvoghan        Vin   Voughan   45    Male    3.90          IN
kkoltin      Katie    Koltin   38  Female    2.78          IN

In [18]:
 Df_12[1:4:] # from index 1 : to index n-1 :

        First_Name Last_Name  Age  Gender  Rating Nationality
lnarmen        Lia    Narmen   28  Female    4.60          IN
vvoghan        Vin   Voughan   45    Male    3.90          IN
kkoltin      Katie    Koltin   38  Female    2.78          IN

In [19]:
Df_12.First_Name.loc[['sgutter']]

sgutter    Steve
Name: First_Name, dtype: object

In [20]:
type(Df_12.First_Name.loc['sgutter'])

pandas.core.series.Series

to run a logical operation on the dataFrame column

In [21]:
Df_12.Age > 30 ## Returns a boolean values where the condition is True or False

sgutter     True
lnarmen    False
vvoghan     True
kkoltin     True
Name: Age, dtype: bool

In [22]:
Df_12.Age[Df_12.Age > 30]

sgutter    32
vvoghan    45
kkoltin    38
Name: Age, dtype: int64

In [23]:
Df_12.at['sgutter', 'Age']

array([32], dtype=int64)

In [24]:
Df_12.iat[0,2]

32

Modifying DataFrame

In [25]:
## Renaming a column, 'inplace=True' would make changes to the original dataSet, defaultly it is set to 'False'
Df_12.rename(columns={'Age':'YearsOld'}, inplace=True)
Df_12.columns

Index(['First_Name', 'Last_Name', 'YearsOld', 'Gender', 'Rating',
       'Nationality'],
      dtype='object')

In [26]:
## Defaulting the infalse
Df_15=Df_12.rename(columns={'YearsOld':'Age'})
Df_15.columns

Index(['First_Name', 'Last_Name', 'Age', 'Gender', 'Rating', 'Nationality'], dtype='object')

In [27]:
Df_12.columns# We can see that the original Dataframe is not changed

Index(['First_Name', 'Last_Name', 'YearsOld', 'Gender', 'Rating',
       'Nationality'],
      dtype='object')

In [28]:
## Adding a new column at the end of the dataframe existing index
Df_12['Salary']=([1000,1200,750,2000])
Df_12

        First_Name Last_Name  YearsOld  Gender  Rating Nationality  Salary
sgutter      Steve    Gutter        32    Male    3.45          IN    1000
lnarmen        Lia    Narmen        28  Female    4.60          IN    1200
vvoghan        Vin   Voughan        45    Male    3.90          IN     750
kkoltin      Katie    Koltin        38  Female    2.78          IN    2000

In [29]:
## To perminantly update a value in a specific space
Df_12.at['kkoltin','Salary'] = 3000
Df_12

        First_Name Last_Name  YearsOld  Gender  Rating Nationality  Salary
sgutter      Steve    Gutter        32    Male    3.45          IN    1000
lnarmen        Lia    Narmen        28  Female    4.60          IN    1200
vvoghan        Vin   Voughan        45    Male    3.90          IN     750
kkoltin      Katie    Koltin        38  Female    2.78          IN    3000

In [30]:
# To access the value directly from the data frame which returns a series object
Df_12[0:1:1]['Salary']

sgutter    1000
Name: Salary, dtype: int64

In [31]:
# To access multiple values of the same collumn, returns a dataframe
Df_12[0:3:1][['Salary']]

         Salary
sgutter    1000
lnarmen    1200
vvoghan     750

In [32]:
# Can also be achieved by loc
Df_12.loc['vvoghan' , 'YearsOld'] = 33
Df_12
#Can also be achived through index location

        First_Name Last_Name  YearsOld  Gender  Rating Nationality  Salary
sgutter      Steve    Gutter        32    Male    3.45          IN    1000
lnarmen        Lia    Narmen        28  Female    4.60          IN    1200
vvoghan        Vin   Voughan        33    Male    3.90          IN     750
kkoltin      Katie    Koltin        38  Female    2.78          IN    3000

In [33]:
## To insert a value inside the dataframe after a specific index
## If a column already exists it will throw an error
Df_12.insert(loc=5,column='Hike',value=[20,10,30,5])
Df_12.insert(loc=6,column='Rank',value=[2,3,1,4])
Df_12.insert(loc=8,column='Eligiblity',value=[1,1,1,1])
Df_12

,First_Name,Last_Name,YearsOld,Gender,Rating,Hike,Rank,Nationality,Eligiblity,Salary
sgutter,Steve,Gutter,32,Male,3.45,20,2,IN,1,1000
lnarmen,Lia,Narmen,28,Female,4.60,10,3,IN,1,1200
vvoghan,Vin,Voughan,33,Male,3.90,30,1,IN,1,750
kkoltin,Katie,Koltin,38,Female,2.78,5,4,IN,1,3000

In [34]:
## To remove a complete column out of the DataFrame
## If the Column is not found it will throw an error
Df_12.pop('Eligiblity') ## --> returns the series which is popped out of dataFrame, can be saved in a different valriables
del(Df_12['Hike']) ##--> del can also be used
Df_15=Df_12.drop(['Rank'], axis=1)## Returns dataframe,useful as we can create new data frames out of it. 
# inplace: False-> to refrain from editing the original dataset, True-> to make changes to original Dataset
# Can delete both rows and column values with axis parameter: axis=[0,1] which is row,column

In [35]:
Df_15

        First_Name Last_Name  YearsOld  Gender  Rating Nationality  Salary
sgutter      Steve    Gutter        32    Male    3.45          IN    1000
lnarmen        Lia    Narmen        28  Female    4.60          IN    1200
vvoghan        Vin   Voughan        33    Male    3.90          IN     750
kkoltin      Katie    Koltin        38  Female    2.78          IN    3000

Append two dataframes
1. DF1 = Df_12.append(Df_15) #If the column names are different then Missibg values will be added as NaN.
2. DF1 = Df_12.append(Df_15, ignore_index = T) # all the index lables will be converted to integers 0,1,2,3....

To add a new row to the dataframe
1. DF.loc['NameOfRow'] = ['its values'] --> if all the values are not provided it will place NaN

Arthematic Operations

In [36]:
Df_12['Salary'] = Df_12['Salary'] * 2
Df_12

,First_Name,Last_Name,YearsOld,Gender,Rating,Rank,Nationality,Salary
sgutter,Steve,Gutter,32,Male,3.45,2,IN,2000
lnarmen,Lia,Narmen,28,Female,4.60,3,IN,2400
vvoghan,Vin,Voughan,33,Male,3.90,1,IN,1500
kkoltin,Katie,Koltin,38,Female,2.78,4,IN,6000

In [37]:
Df_12.at['sgutter','Salary'] =  Df_12.loc['sgutter','Salary'] + 40
Df_12

,First_Name,Last_Name,YearsOld,Gender,Rating,Rank,Nationality,Salary
sgutter,Steve,Gutter,32,Male,3.45,2,IN,2040
lnarmen,Lia,Narmen,28,Female,4.60,3,IN,2400
vvoghan,Vin,Voughan,33,Male,3.90,1,IN,1500
kkoltin,Katie,Koltin,38,Female,2.78,4,IN,6000

In [38]:
Df_12.loc['sgutter','Salary']

sgutter    2040
Name: Salary, dtype: int64

Re-Indexing

In [39]:
## To save the existing index into a new column, change will alwasys be set to new variable but not original DataFrame
Df_13 = Df_12.reset_index()
Df_13

,level_0,First_Name,Last_Name,YearsOld,Gender,Rating,Rank,Nationality,Salary
0,sgutter,Steve,Gutter,32,Male,3.45,2,IN,2040
1,lnarmen,Lia,Narmen,28,Female,4.60,3,IN,2400
2,vvoghan,Vin,Voughan,33,Male,3.90,1,IN,1500
3,kkoltin,Katie,Koltin,38,Female,2.78,4,IN,6000

In [40]:
# To set a column values into index, change will alwasys be set to new variable but not original DataFrame
Df_13 = Df_12.set_index('First_Name')
Df_13

           Last_Name  YearsOld  Gender  Rating  Rank Nationality  Salary
First_Name
Steve         Gutter        32    Male    3.45     2          IN    2040
Lia           Narmen        28  Female    4.60     3          IN    2400
Vin          Voughan        33    Male    3.90     1          IN    1500
Katie         Koltin        38  Female    2.78     4          IN    6000

In [41]:
#To reindex the column values, Data will be lost if the mapping is incorrect
Df_13 = Df_15.reindex()
Df_13

        First_Name Last_Name  YearsOld  Gender  Rating Nationality  Salary
sgutter      Steve    Gutter        32    Male    3.45          IN    1000
lnarmen        Lia    Narmen        28  Female    4.60          IN    1200
vvoghan        Vin   Voughan        33    Male    3.90          IN     750
kkoltin      Katie    Koltin        38  Female    2.78          IN    3000

In [42]:
Df_13 = Df_15.reset_index()
Df_13['id_No'] = [4374,4373,4375,4372]

In [43]:
Df_13 = Df_13.set_index(['level_0' ,'id_No'])
Df_13

,,First_Name,Last_Name,YearsOld,Gender,Rating,Nationality,Salary
level_0,id_No,,,,,,,
sgutter,4374,Steve,Gutter,32,Male,3.45,IN,1000
lnarmen,4373,Lia,Narmen,28,Female,4.60,IN,1200
vvoghan,4375,Vin,Voughan,33,Male,3.90,IN,750
kkoltin,4372,Katie,Koltin,38,Female,2.78,IN,3000

In [93]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

e = {'one' : pd.Series([7, 2, 8], index=['a', 'b', 'c']),
   'two' : pd.Series([4, 8, 3, 4], index=['a', 'b', 'c', 'd'])}
df1 = pd.DataFrame(d)
df2 = pd.DataFrame(e)
df = df1.merge(df2)

In [45]:
df['three']=df1['one']+df2['two']
df

   one  two  three
0  NaN    4    NaN

In [47]:
## To delete a row
df.drop(index='d',inplace=True, axis =1)
df

KeyError: "['d'] not found in axis"

Concatination of two dataFrames

In [48]:
pd.concat([df1,df2] , keys=['df1','df2'], axis = 0)

       one  two
df1 a  1.0    1
    b  2.0    2
    c  3.0    3
    d  NaN    4
df2 a  7.0    4
    b  2.0    8
    c  8.0    3
    d  NaN    4

In [49]:
pd.concat([df1,df2] , keys=['df1','df2'], axis = 1)

   df1      df2
   one two  one two
a  1.0   1  7.0   4
b  2.0   2  2.0   8
c  3.0   3  8.0   3
d  NaN   4  NaN   4

Merging the data. merge() function only works if there is commanality [intersection of keys] in either column/row of operand datasets. If merge should be with reference of a column comonality, it has to be given in ON parameter.
Merges are similar SQL's left join, right join, outer join and inner join.
1. DataFrame_X.merge(DataFrame_Y , on = 'Column1' , how = 'method of join')
                OR
1. Merged_DataSet = pd.merge(left_DF, right_DF , on = 'Which Column to Join' , how = 'method of join' )

                                           Method of Join
1. Left Outer Join --> No changes would be made to the left[first] dataframe but on right[second] dataFrame NaN values will be added if similar Row/Collumn details are not found in the 'on' parameter column.
2. Right Outer Join --> No changes would be made to the right[second] dataframe but on left[first] dataFrame NaN values will be added if similar Row/Collumn details are not found in the 'on' parameter column.
3. if by any chance the column names are different in both the datasets we can use 'left_on' and 'right_on' parameters

In [50]:
df1.merge(df2)

   one  two
0  NaN    4

In [72]:
## Mapping a column into the existing DataFrame with the help of map() funtion
five = pd.Series(data=[5,6,7,8],index=['c','d','b','a'])
five

c    5
d    6
b    7
a    8
dtype: int64

In [94]:
df1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [95]:
df1['two'].index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [96]:
df1['five'] = five
df1

   one  two  five
a  1.0    1     8
b  2.0    2     7
c  3.0    3     5
d  NaN    4     6

In [104]:
four = {1 : 'a' , 2: 'b' , 3: 'c' , 4: 'd'}
four.keys()

dict_keys([1, 2, 3, 4])

In [105]:
# Setting the values of a new column based on a different volumn's values
df1['three'] = df1['two'].map(four)
df1

   one  two  five three
a  1.0    1     8     a
b  2.0    2     7     b
c  3.0    3     5     c
d  NaN    4     6     d

In [107]:
# Wrong way of adding a value to a specific rowXcolumn
df1['c','three'] = 'C'
df1

   one  two  five three (c, three)
a  1.0    1     8     a          C
b  2.0    2     7     b          C
c  3.0    3     5     c          C
d  NaN    4     6     d          C

In [108]:
df1.columns

Index(['one', 'two', 'five', 'three', ('c', 'three')], dtype='object')

In [111]:
# To delete a column with multiple values
del(df1['c','three'])
df1

   one  two  five three
a  1.0    1     8     a
b  2.0    2     7     b
c  3.0    3     5     c
d  NaN    4     6     d

In [121]:
# The correct way to add specific value do it
df1.loc['c','three'] = 'C'
df1

   one  two  five three
a  1.0    1     8     a
b  2.0    2     7     b
c  3.0    3     5     C
d  NaN    4     6     d

In [139]:
#Two square brackets generally gives out all the indices
df1[[]]

Empty DataFrame
Columns: []
Index: [a, b, c, d]

In [123]:
## To change the order of columns, OBSERVE that there are TWO SQUARE BRACKETS in them
df1 = df1[['one','two','three','five']]
df1

   one  two three  five
a  1.0    1     a     8
b  2.0    2     b     7
c  3.0    3     C     5
d  NaN    4     d     6